{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"keras_tensor_80": {"name": "keras_tensor_80:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "8"}, {"size": "8"}, {"size": "2"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "64"}]}}, "output_1": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_8_1/policy_hidden_1/mul_1/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/policy_hidden_1/mul/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/policy_hidden_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/policy_hidden_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/policy_hidden_1/Pow/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/policy_logits_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/policy_logits_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/reshape_1_2/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/reshape_1_2/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/reshape_1_2/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/reshape_1_2/Reshape/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/value_1/mul_1/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/value_1/mul/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/value_hidden_1/mul_1/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/value_hidden_1/mul/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/conv1d_1/mul_1/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/conv1d_1/mul/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_0_3/multi_head_attention_14_1/query_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_0_3/multi_head_attention_14_1/query_1/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_0_3/multi_head_attention_14_1/query_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_0_3/multi_head_attention_14_1/key_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_0_3/multi_head_attention_14_1/key_1/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_0_3/multi_head_attention_14_1/key_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_0_3/multi_head_attention_14_1/Cast/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_0_3/layer_normalization_28_1/moments/mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_0_3/layer_normalization_28_1/moments/variance/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_0_3/layer_normalization_28_1/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_0_3/layer_normalization_28_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_0_3/layer_normalization_28_1/Reshape_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_0_3/multi_head_attention_14_1/value_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_0_3/multi_head_attention_14_1/value_1/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_0_3/multi_head_attention_14_1/value_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_0_3/multi_head_attention_14_1/attention_output_1/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_0_3/multi_head_attention_14_1/attention_output_1/Reshape_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_0_3/multi_head_attention_14_1/attention_output_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_1_3/multi_head_attention_15_1/query_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_1_3/multi_head_attention_15_1/query_1/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_1_3/multi_head_attention_15_1/query_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_1_3/multi_head_attention_15_1/key_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_1_3/multi_head_attention_15_1/key_1/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_1_3/multi_head_attention_15_1/key_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_1_3/multi_head_attention_15_1/Cast/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_1_3/layer_normalization_29_1/moments/mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_1_3/layer_normalization_29_1/moments/variance/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_1_3/layer_normalization_29_1/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_1_3/layer_normalization_29_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_1_3/layer_normalization_29_1/Reshape_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_1_3/multi_head_attention_15_1/value_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_1_3/multi_head_attention_15_1/value_1/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_1_3/multi_head_attention_15_1/value_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_1_3/multi_head_attention_15_1/attention_output_1/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_1_3/multi_head_attention_15_1/attention_output_1/Reshape_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_1_3/multi_head_attention_15_1/attention_output_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_0_3/dense_29_1/mul_1/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_0_3/dense_29_1/mul/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_0_3/layer_normalization_30_1/moments/mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_0_3/layer_normalization_30_1/moments/variance/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_0_3/layer_normalization_30_1/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_0_3/layer_normalization_30_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_0_3/layer_normalization_30_1/Reshape_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_0_3/dense_29_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_0_3/dense_29_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_0_3/dense_29_1/Pow/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_0_3/dense_30_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_0_3/dense_30_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_1_3/dense_31_1/mul_1/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_1_3/dense_31_1/mul/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_1_3/layer_normalization_31_1/moments/mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_1_3/layer_normalization_31_1/moments/variance/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_1_3/layer_normalization_31_1/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_1_3/layer_normalization_31_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_1_3/layer_normalization_31_1/Reshape_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_1_3/dense_31_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_1_3/dense_31_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_1_3/dense_31_1/Pow/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_1_3/dense_32_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_1_3/dense_32_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_0_1/multi_head_attention_14_1/query_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_0_1/multi_head_attention_14_1/query_1/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_0_1/multi_head_attention_14_1/query_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_0_1/multi_head_attention_14_1/key_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_0_1/multi_head_attention_14_1/key_1/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_0_1/multi_head_attention_14_1/key_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_0_1/multi_head_attention_14_1/Cast/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_0_1/layer_normalization_28_1/moments/mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_0_1/layer_normalization_28_1/moments/variance/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_0_1/layer_normalization_28_1/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_0_1/layer_normalization_28_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_0_1/layer_normalization_28_1/Reshape_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_0_1/multi_head_attention_14_1/value_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_0_1/multi_head_attention_14_1/value_1/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_0_1/multi_head_attention_14_1/value_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_0_1/multi_head_attention_14_1/attention_output_1/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_0_1/multi_head_attention_14_1/attention_output_1/Reshape_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_0_1/multi_head_attention_14_1/attention_output_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_1_1/multi_head_attention_15_1/query_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_1_1/multi_head_attention_15_1/query_1/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_1_1/multi_head_attention_15_1/query_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_1_1/multi_head_attention_15_1/key_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_1_1/multi_head_attention_15_1/key_1/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_1_1/multi_head_attention_15_1/key_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_1_1/multi_head_attention_15_1/Cast/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_1_1/layer_normalization_29_1/moments/mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_1_1/layer_normalization_29_1/moments/variance/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_1_1/layer_normalization_29_1/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_1_1/layer_normalization_29_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_1_1/layer_normalization_29_1/Reshape_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_1_1/multi_head_attention_15_1/value_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_1_1/multi_head_attention_15_1/value_1/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_1_1/multi_head_attention_15_1/value_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_1_1/multi_head_attention_15_1/attention_output_1/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_1_1/multi_head_attention_15_1/attention_output_1/Reshape_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_mha_1_1/multi_head_attention_15_1/attention_output_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_0_1/dense_29_1/mul_1/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_0_1/dense_29_1/mul/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_0_1/layer_normalization_30_1/moments/mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_0_1/layer_normalization_30_1/moments/variance/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_0_1/layer_normalization_30_1/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_0_1/layer_normalization_30_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_0_1/layer_normalization_30_1/Reshape_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_0_1/dense_29_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_0_1/dense_29_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_0_1/dense_29_1/Pow/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_0_1/dense_30_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_0_1/dense_30_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_1_1/dense_31_1/mul_1/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_1_1/dense_31_1/mul/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_1_1/layer_normalization_31_1/moments/mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_1_1/layer_normalization_31_1/moments/variance/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_1_1/layer_normalization_31_1/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_1_1/layer_normalization_31_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_1_1/layer_normalization_31_1/Reshape_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_1_1/dense_31_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_1_1/dense_31_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_1_1/dense_31_1/Pow/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_1_1/dense_32_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_3_1/pool_ffn_1_1/dense_32_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_mha_0_3/multi_head_attention_12_1/query_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_mha_0_3/multi_head_attention_12_1/query_1/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_mha_0_3/multi_head_attention_12_1/query_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_mha_0_3/multi_head_attention_12_1/key_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_mha_0_3/multi_head_attention_12_1/key_1/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_mha_0_3/multi_head_attention_12_1/key_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_mha_0_3/multi_head_attention_12_1/Cast/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_mha_0_3/layer_normalization_24_1/moments/mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_mha_0_3/layer_normalization_24_1/moments/variance/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_mha_0_3/layer_normalization_24_1/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_mha_0_3/layer_normalization_24_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_mha_0_3/layer_normalization_24_1/Reshape_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_mha_0_3/multi_head_attention_12_1/value_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_mha_0_3/multi_head_attention_12_1/value_1/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_mha_0_3/multi_head_attention_12_1/value_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_mha_0_3/multi_head_attention_12_1/attention_output_1/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_mha_0_3/multi_head_attention_12_1/attention_output_1/Reshape_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_mha_0_3/multi_head_attention_12_1/attention_output_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_mha_1_3/multi_head_attention_13_1/query_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_mha_1_3/multi_head_attention_13_1/query_1/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_mha_1_3/multi_head_attention_13_1/query_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_mha_1_3/multi_head_attention_13_1/key_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_mha_1_3/multi_head_attention_13_1/key_1/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_mha_1_3/multi_head_attention_13_1/key_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_mha_1_3/multi_head_attention_13_1/Cast/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_mha_1_3/layer_normalization_25_1/moments/mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_mha_1_3/layer_normalization_25_1/moments/variance/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_mha_1_3/layer_normalization_25_1/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_mha_1_3/layer_normalization_25_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_mha_1_3/layer_normalization_25_1/Reshape_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_mha_1_3/multi_head_attention_13_1/value_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_mha_1_3/multi_head_attention_13_1/value_1/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_mha_1_3/multi_head_attention_13_1/value_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_mha_1_3/multi_head_attention_13_1/attention_output_1/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_mha_1_3/multi_head_attention_13_1/attention_output_1/Reshape_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_mha_1_3/multi_head_attention_13_1/attention_output_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_ffn_0_3/dense_25_1/mul_1/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_ffn_0_3/dense_25_1/mul/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_ffn_0_3/layer_normalization_26_1/moments/mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_ffn_0_3/layer_normalization_26_1/moments/variance/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_ffn_0_3/layer_normalization_26_1/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_ffn_0_3/layer_normalization_26_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_ffn_0_3/layer_normalization_26_1/Reshape_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_ffn_0_3/dense_25_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_ffn_0_3/dense_25_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_ffn_0_3/dense_25_1/Pow/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_ffn_0_3/dense_26_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_ffn_0_3/dense_26_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_ffn_1_3/dense_27_1/mul_1/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_ffn_1_3/dense_27_1/mul/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_8_1/moe_block_2_1/pool_ffn_1_3/layer_normalization_27_1/moments/mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": 